
## Plan Result

[CI link](https://github.com/MurakamiHonami/streeeak/actions/runs/23100930278)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 2 to change, 6 to destroy.</code></pre>

* Create
  * aws_codepipeline.main
  * aws_dynamodb_table.blocks
  * aws_dynamodb_table.friendships
  * aws_dynamodb_table.goals
  * aws_dynamodb_table.group_members
  * aws_dynamodb_table.groups
  * aws_dynamodb_table.meta
  * aws_dynamodb_table.post_likes
  * aws_dynamodb_table.posts
  * aws_dynamodb_table.tasks
  * aws_dynamodb_table.user_settings
  * aws_dynamodb_table.users
* Update
  * aws_cognito_user_pool_client.client
  * aws_ecs_service.backend
* Delete
  * aws_db_instance.main
  * aws_db_subnet_group.main
  * aws_lb_target_group.ecs
  * aws_route53_record.route53_record
  * aws_security_group.db_sg
* Replace
  * aws_security_group.web_sg


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_codepipeline.main will be created
  + resource "aws_codepipeline" "main" {
      + arn            = (known after apply)
      + execution_mode = "SUPERSEDED"
      + id             = (known after apply)
      + name           = "streeeak-pipeline"
      + pipeline_type  = "V1"
      + role_arn       = "arn:aws:iam::382715181910:role/service-role/AWSCodePipelineServiceRole-ap-northeast-1-streeeak-pipeline"
      + tags_all       = (known after apply)
      + trigger_all    = (known after apply)

      + artifact_store {
          + location = "streeeak-frontend-111"
          + type     = "S3"
            # (1 unchanged attribute hidden)
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "BranchName"       = "main"
                  + "ConnectionArn"    = "arn:aws:codeconnections:ap-northeast-1:382715181910:connection/4e9ee864-cc52-4c92-acc5-fe287f6b5b58"
                  + "FullRepositoryId" = "https://github.com/MurakamiHonami/streeeak"
                }
              + name             = "Source"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeStarSourceConnection"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"

          + action {
              + category         = "Build"
              + configuration    = {
                  + "ProjectName" = "streeeak-build"
                }
              + input_artifacts  = [
                  + "source_output",
                ]
              + name             = "Build"
              + output_artifacts = [
                  + "build_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ClusterName" = "streeeak-prod-cluster"
                  + "FileName"    = "imagedefinitions.json"
                  + "ServiceName" = "streeeak-backend-service"
                }
              + input_artifacts = [
                  + "build_output",
                ]
              + name            = "Deploy"
              + owner           = "AWS"
              + provider        = "ECS"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # aws_cognito_user_pool_client.client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "client" {
      ~ explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
        id                                            = "3ifc021c22vfljgdrefg885mdu"
        name                                          = "streeeak-app-client"
      + prevent_user_existence_errors                 = "ENABLED"
        # (18 unchanged attributes hidden)
    }

  # aws_db_instance.main will be destroyed
  # (because aws_db_instance.main is not in configuration)
  - resource "aws_db_instance" "main" {
      - address                               = "streeeak-db.cd0iy8weqkm6.ap-northeast-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 20 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:ap-northeast-1:382715181910:db:streeeak-db" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "ap-northeast-1d" -> null
      - backup_retention_period               = 1 -> null
      - backup_target                         = "region" -> null
      - backup_window                         = "18:27-18:57" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - copy_tags_to_snapshot                 = true -> null
      - customer_owned_ip_enabled             = false -> null
      - database_insights_mode                = "standard" -> null
      - db_subnet_group_name                  = "streeeak-db-subnet-group" -> null
      - dedicated_log_volume                  = false -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "streeeak-db.cd0iy8weqkm6.ap-northeast-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_lifecycle_support              = "open-source-rds-extended-support-disabled" -> null
      - engine_version                        = "17.6" -> null
      - engine_version_actual                 = "17.6" -> null
      - hosted_zone_id                        = "Z24O6O9L7SGTNB" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "db-B75JBKLQMONXXL34RLPNNNLEXI" -> null
      - identifier                            = "streeeak-db" -> null
      - instance_class                        = "db.t3.micro" -> null
      - iops                                  = 0 -> null
      - kms_key_id                            = "arn:aws:kms:ap-northeast-1:382715181910:key/c6abd93b-63d2-4fcb-b2d8-859e1d76adb1" -> null
      - latest_restorable_time                = "2026-03-12T02:54:39Z" -> null
      - license_model                         = "postgresql-license" -> null
      - listener_endpoint                     = [] -> null
      - maintenance_window                    = "wed:16:59-wed:17:29" -> null
      - master_user_secret                    = [] -> null
      - max_allocated_storage                 = 1000 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = true -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:postgres-17" -> null
      - parameter_group_name                  = "default.postgres17" -> null
      - password_wo                           = (write-only attribute) -> null
      - performance_insights_enabled          = true -> null
      - performance_insights_kms_key_id       = "arn:aws:kms:ap-northeast-1:382715181910:key/c6abd93b-63d2-4fcb-b2d8-859e1d76adb1" -> null
      - performance_insights_retention_period = 7 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-B75JBKLQMONXXL34RLPNNNLEXI" -> null
      - skip_final_snapshot                   = true -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_throughput                    = 0 -> null
      - storage_type                          = "gp2" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - username                              = "postgres" -> null
      - vpc_security_group_ids                = [
          - "sg-05a9eba884c288c2e",
        ] -> null
        # (14 unchanged attributes hidden)
    }

  # aws_db_subnet_group.main will be destroyed
  # (because aws_db_subnet_group.main is not in configuration)
  - resource "aws_db_subnet_group" "main" {
      - arn                     = "arn:aws:rds:ap-northeast-1:382715181910:subgrp:streeeak-db-subnet-group" -> null
      - description             = "streeeak-db-subnet-group" -> null
      - id                      = "streeeak-db-subnet-group" -> null
      - name                    = "streeeak-db-subnet-group" -> null
      - subnet_ids              = [
          - "subnet-075aae2dae16f6cb5",
          - "subnet-08afe13e3340e12a7",
          - "subnet-09014ecc819595db2",
          - "subnet-0d3a7f17394dd95f0",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - vpc_id                  = "vpc-045e564f91057c27f" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_dynamodb_table.blocks will be created
  + resource "aws_dynamodb_table" "blocks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-blocks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "blocked_user_id"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "blocked_user_id"
          + name               = "BlockedUserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.friendships will be created
  + resource "aws_dynamodb_table" "friendships" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-friendships"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "friend_id"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "friend_id"
          + name               = "FriendIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.goals will be created
  + resource "aws_dynamodb_table" "goals" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-goals"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.group_members will be created
  + resource "aws_dynamodb_table" "group_members" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-group-members"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "group_id"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "group_id"
          + name               = "GroupIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.groups will be created
  + resource "aws_dynamodb_table" "groups" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-groups"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "owner_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "owner_id"
          + name               = "OwnerIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.meta will be created
  + resource "aws_dynamodb_table" "meta" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "entity"
      + id               = (known after apply)
      + name             = "streeeak-meta"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "entity"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.post_likes will be created
  + resource "aws_dynamodb_table" "post_likes" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-post-likes"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "post_id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "post_id"
          + name               = "PostIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.posts will be created
  + resource "aws_dynamodb_table" "posts" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-posts"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "group_id"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "group_id"
          + name               = "GroupIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.tasks will be created
  + resource "aws_dynamodb_table" "tasks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-tasks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "goal_id"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "goal_id"
          + name               = "GoalIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + global_secondary_index {
          + hash_key           = "user_id"
          + name               = "UserIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.user_settings will be created
  + resource "aws_dynamodb_table" "user_settings" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "user_id"
      + id               = (known after apply)
      + name             = "streeeak-user-settings"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.users will be created
  + resource "aws_dynamodb_table" "users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "streeeak-users"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "email"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "email"
          + name               = "EmailIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_ecs_service.backend will be updated in-place
  ~ resource "aws_ecs_service" "backend" {
        id                                 = "arn:aws:ecs:ap-northeast-1:382715181910:service/streeeak-prod-cluster/streeeak-backend-service"
        name                               = "streeeak-backend-service"
        tags                               = {}
        # (17 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "streeeak-backend-container" -> null
          - container_port   = 8000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:382715181910:targetgroup/streeeak-ecs-tg/01efa72a4acbee4d" -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0e91510f091b29190",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.ecs will be destroyed
  # (because aws_lb_target_group.ecs is not in configuration)
  - resource "aws_lb_target_group" "ecs" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:382715181910:targetgroup/streeeak-ecs-tg/01efa72a4acbee4d" -> null
      - arn_suffix                         = "targetgroup/streeeak-ecs-tg/01efa72a4acbee4d" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:382715181910:targetgroup/streeeak-ecs-tg/01efa72a4acbee4d" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-northeast-1:382715181910:loadbalancer/app/streeeak-alb/836fde8dd1273724",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "streeeak-ecs-tg" -> null
      - port                               = 8000 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-045e564f91057c27f" -> null
        # (1 unchanged attribute hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 3 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # aws_route53_record.route53_record will be destroyed
  # (because aws_route53_record.route53_record is not in configuration)
  - resource "aws_route53_record" "route53_record" {
      - fqdn                             = "api.streeeak.link" -> null
      - id                               = "Z05621061XS00CT9XIT1S_api.streeeak.link_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "api.streeeak.link" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z05621061XS00CT9XIT1S" -> null
        # (2 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "streeeak-alb-696483565.ap-northeast-1.elb.amazonaws.com" -> null
          - zone_id                = "Z14GRHDCWA56QT" -> null
        }
    }

  # aws_security_group.db_sg will be destroyed
  # (because aws_security_group.db_sg is not in configuration)
  - resource "aws_security_group" "db_sg" {
      - arn         = "arn:aws:ec2:ap-northeast-1:382715181910:security-group/sg-05a9eba884c288c2e" -> null
      - description = "Security group for Streeeak RDS" -> null
      - egress      = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id          = "sg-05a9eba884c288c2e" -> null
      - ingress     = [
          - {
              - cidr_blocks      = []
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0e91510f091b29190",
                ]
              - self             = false
              - to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name        = "streeeak-rds-sg" -> null
      - owner_id    = "382715181910" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - vpc_id      = "vpc-045e564f91057c27f" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.web_sg must be replaced
-/+ resource "aws_security_group" "web_sg" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:382715181910:security-group/sg-0e91510f091b29190" -> (known after apply)
      ~ description            = "Security group for Streeeak API EC2" -> "Security group for Streeeak ECS backend" # forces replacement
      ~ id                     = "sg-0e91510f091b29190" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
                # (1 unchanged attribute hidden)
            },
          - {
              - cidr_blocks      = []
              - from_port        = 8000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0a3cf7e6472e0d1d7",
                ]
              - self             = false
              - to_port          = 8000
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
                # (1 unchanged attribute hidden)
            },
        ]
      ~ name                   = "streeeak-ec2-sg" -> "streeeak-ecs-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "382715181910" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "streeeak-ec2-sg" -> "streeeak-ecs-sg"
        }
      ~ tags_all               = {
          ~ "Name" = "streeeak-ec2-sg" -> "streeeak-ecs-sg"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 13 to add, 2 to change, 6 to destroy.

Changes to Outputs:
  + ecr_backend_repository_url = "382715181910.dkr.ecr.ap-northeast-1.amazonaws.com/streeeak-backend"
  + ecs_cluster_name           = "streeeak-prod-cluster"
  + ecs_service_name           = "streeeak-backend-service"
  ~ web_sg_id                  = "sg-0e91510f091b29190" -> (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"9a2d91563a054676ba3d619c3ee40a4df2bf2cb1","Vars":{},"WorkflowName":"Terraform Deploy"} -->